doc/blog/using-covid-19-pubseq-part3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-30 Sat 10:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>COVID-19 PubSeq Uploading Data (part 3)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pjotr Prins" />
<link rel="Blog stylesheet" type="text/css" href="blog.css" />
</head>
<body>
<div id="content">
<h1 class="title">COVID-19 PubSeq Uploading Data (part 3)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7fda7c8">1. Uploading Data</a></li>
<li><a href="#orgb062ac0">2. Introduction</a></li>
<li><a href="#org4061598">3. Step 1: Upload sequence</a></li>
<li><a href="#org51d80f8">4. Step 2: Add metadata</a>
<ul>
<li><a href="#orgbb8f0bb">4.1. Obligatory fields</a>
<ul>
<li><a href="#org0e615dc">4.1.1. Sample ID (sample<sub>id</sub>)</a></li>
<li><a href="#org4d5308a">4.1.2. Collection date</a></li>
<li><a href="#org429f153">4.1.3. Collection location</a></li>
<li><a href="#orgbd7fa51">4.1.4. Sequencing technology</a></li>
<li><a href="#orgc3b424f">4.1.5. Authors</a></li>
</ul>
</li>
<li><a href="#org5c01347">4.2. Optional fields</a>
<ul>
<li><a href="#org7fc5461">4.2.1. Host information</a></li>
<li><a href="#org140c8b5">4.2.2. Collecting institution</a></li>
<li><a href="#orgf231cf9">4.2.3. Specimen source</a></li>
<li><a href="#org74de839">4.2.4. Source database accession</a></li>
<li><a href="#org8927a67">4.2.5. Strain name</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org38d48d8">5. Step 3: Submit to COVID-19 PubSeq</a></li>
<li><a href="#org5ec1337">6. Step 4: Check output</a>
<ul>
<li><a href="#org070e13e">6.1. Trouble shooting</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7fda7c8" class="outline-2">
<h2 id="org7fda7c8"><span class="section-number-2">1</span> Uploading Data</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Work in progress!</i>
</p>
</div>
</div>

<div id="outline-container-orgb062ac0" class="outline-2">
<h2 id="orgb062ac0"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
The COVID-19 PubSeq allows you to upload your SARS-Cov-2 strains to a
public resource for global comparisons. Compute it triggered on
upload. Read the <a href="./about">ABOUT</a> page for more information.
</p>
</div>
</div>

<div id="outline-container-org4061598" class="outline-2">
<h2 id="org4061598"><span class="section-number-2">3</span> Step 1: Upload sequence</h2>
<div class="outline-text-2" id="text-3">
<p>
To upload a sequence in the <a href="http://covid19.genenetwork.org/">web upload page</a> hit the browse button and
select the FASTA file on your local hard disk.
</p>

<p>
We start with an assembled or mapped sequence in FASTA format. The
PubSeq uploader contains a <a href="https://github.com/arvados/bh20-seq-resource/blob/master/bh20sequploader/qc_fasta.py">QC step</a> which checks whether it is a likely
SARS-CoV-2 sequence. While PubSeq deduplicates sequences and never
overwrites metadata, you may still want to check whether your data
already is in the system by querying some metadata as described in
<a href="./blog?id=using-covid-19-pubseq-part1">Query metadata with SPARQL</a> or by simply downloading and checking one
of the files on the <a href="./download">download</a> page. We find GenBank <a href="https://www.ncbi.nlm.nih.gov/nuccore/MT536190">MT536190.1</a> has not
been included yet. A FASTA text file can be <a href="https://www.ncbi.nlm.nih.gov/nuccore/MT536190.1?report=fasta&amp;log$=seqview&amp;format=text">downloaded</a> to your local
disk and uploaded through our <a href="./">web upload page</a>. Make sure the file does
not include any HTML!
</p>

<p>
Note: we currently only allow FASTA uploads. In the near future we'll
allow for uploading raw sequence files. This is important for creating
an improved pangenome.
</p>
</div>
</div>

<div id="outline-container-org51d80f8" class="outline-2">
<h2 id="org51d80f8"><span class="section-number-2">4</span> Step 2: Add metadata</h2>
<div class="outline-text-2" id="text-4">
<p>
The <a href="./">web upload page</a> contains fields for adding metadata. Metadata is
not only important for attribution, is also important for
analysis. The metadata is available for queries, see <a href="./blog?id=using-covid-19-pubseq-part1">Query metadata
with SPARQL</a>, and can be used to annotate variations of the virus in
different ways.
</p>

<p>
A number of fields are obligatory: sample id, date, location,
technology and authors. The others are optional, but it is valuable to
enter them when information is available. Metadata is defined in this
<a href="https://github.com/arvados/bh20-seq-resource/blob/master/bh20sequploader/bh20seq-schema.yml">schema</a>. From this schema we generate the input form. Note that
opitional fields have a question mark in the <code>type</code>. You can add
metadata yourself, btw, because this is a public resource! See also
<a href="./blog?id=using-covid-19-pubseq-part5">Modify metadata</a> for more information.
</p>

<p>
To get more information about a field click on the question mark on
the web form. Here we add some extra information.
</p>
</div>

<div id="outline-container-orgbb8f0bb" class="outline-3">
<h3 id="orgbb8f0bb"><span class="section-number-3">4.1</span> Obligatory fields</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org0e615dc" class="outline-4">
<h4 id="org0e615dc"><span class="section-number-4">4.1.1</span> Sample ID (sample<sub>id</sub>)</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
This is a string field that defines a unique sample identifier by the
submitter. In addition to sample<sub>id</sub> we also have host<sub>id</sub>,
provider<sub>sample</sub><sub>id</sub> and submitter<sub>sample</sub><sub>id</sub> where host is the host the
sample came from, provider sample is the institution sample id and
submitter is the submitting individual id. host<sub>id</sub> is important when
multiple sequences come from the same host. Make sure not to have
spaces in the sample<sub>id</sub>.
</p>

<p>
Here we add the GenBank ID MT536190.1.
</p>
</div>
</div>

<div id="outline-container-org4d5308a" class="outline-4">
<h4 id="org4d5308a"><span class="section-number-4">4.1.2</span> Collection date</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Estimated collection date. The GenBank page says April 6, 2020.
</p>
</div>
</div>

<div id="outline-container-org429f153" class="outline-4">
<h4 id="org429f153"><span class="section-number-4">4.1.3</span> Collection location</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
A search on wikidata says Los Angelos is
<a href="https://www.wikidata.org/entity/Q65">https://www.wikidata.org/entity/Q65</a>
</p>
</div>
</div>

<div id="outline-container-orgbd7fa51" class="outline-4">
<h4 id="orgbd7fa51"><span class="section-number-4">4.1.4</span> Sequencing technology</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
GenBank entry says Illumina, so we can fill that in
</p>
</div>
</div>

<div id="outline-container-orgc3b424f" class="outline-4">
<h4 id="orgc3b424f"><span class="section-number-4">4.1.5</span> Authors</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
GenBank entry says 'Lamers,S., Nolan,D.J., Rose,R., Cross,S., Moraga
Amador,D., Yang,T., Caruso,L., Navia,W., Von Borstel,L., Hui Zhou,X.,
Freehan,A. and Garcia-Diaz,J.', so we can fill that in.
</p>
</div>
</div>
</div>

<div id="outline-container-org5c01347" class="outline-3">
<h3 id="org5c01347"><span class="section-number-3">4.2</span> Optional fields</h3>
<div class="outline-text-3" id="text-4-2">
<p>
All other fields are optional. But let's see what we can add.
</p>
</div>

<div id="outline-container-org7fc5461" class="outline-4">
<h4 id="org7fc5461"><span class="section-number-4">4.2.1</span> Host information</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Sadly, not much is known about the host from GenBank. A little
sleuthing renders an interesting paper by some of the authors titled
<a href="https://www.medrxiv.org/content/10.1101/2020.04.24.20078691v1">SARS-CoV-2 is consistent across multiple samples and methodologies</a>
which dates after the sample, but has no reference other than that the
raw data came from the SRA database, so it probably does not describe
this particular sample. We don't know what this strain of SARS-Cov-2
did to the person and what the person was like (say age group).
</p>
</div>
</div>

<div id="outline-container-org140c8b5" class="outline-4">
<h4 id="org140c8b5"><span class="section-number-4">4.2.2</span> Collecting institution</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
We can fill that in.
</p>
</div>
</div>

<div id="outline-container-orgf231cf9" class="outline-4">
<h4 id="orgf231cf9"><span class="section-number-4">4.2.3</span> Specimen source</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
We have that: nasopharyngeal swab
</p>
</div>
</div>

<div id="outline-container-org74de839" class="outline-4">
<h4 id="org74de839"><span class="section-number-4">4.2.4</span> Source database accession</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Genbank which is <a href="http://identifiers.org/insdc/MT536190.1#sequence">http://identifiers.org/insdc/MT536190.1#sequence</a>.
Note we plug in our own identifier MT536190.1.
</p>
</div>
</div>

<div id="outline-container-org8927a67" class="outline-4">
<h4 id="org8927a67"><span class="section-number-4">4.2.5</span> Strain name</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
SARS-CoV-2/human/USA/LA-BIE-070/2020
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org38d48d8" class="outline-2">
<h2 id="org38d48d8"><span class="section-number-2">5</span> Step 3: Submit to COVID-19 PubSeq</h2>
<div class="outline-text-2" id="text-5">
<p>
Once you have the sequence and the metadata together, hit
the 'Add to Pangenome' button. The data will be checked,
submitted and the workflows should kick in!
</p>
</div>
</div>

<div id="outline-container-org5ec1337" class="outline-2">
<h2 id="org5ec1337"><span class="section-number-2">6</span> Step 4: Check output</h2>
<div class="outline-text-2" id="text-6">
<p>
The current pipeline takes 5.5 hours to complete! Once it completes
the updated data can be checked on the <a href="./download">DOWNLOAD</a> page. After completion
of above output this <a href="http://sparql.genenetwork.org/sparql/?default-graph-uri=&amp;query=PREFIX+pubseq%3A+%3Chttp%3A%2F%2Fbiohackathon.org%2Fbh20-seq-schema%23MainSchema%2F%3E%0D%0APREFIX+sio%3A+%3Chttp%3A%2F%2Fsemanticscience.org%2Fresource%2F%3E%0D%0Aselect+distinct+%3Fsample+%3Fp+%3Fo%0D%0A%7B%0D%0A+++%3Fsample+sio%3ASIO_000115+%22MT536190.1%22+.%0D%0A+++%3Fsample+%3Fp+%3Fo+.%0D%0A%7D&amp;format=text%2Fhtml&amp;timeout=0&amp;debug=on&amp;run=+Run+Query+">SPARQL query</a> shows some of the metadata we put
in.
</p>
</div>

<div id="outline-container-org070e13e" class="outline-3">
<h3 id="org070e13e"><span class="section-number-3">6.1</span> Trouble shooting</h3>
<div class="outline-text-3" id="text-6-1">
<p>
We got an error saying: {"stem": "<a href="http://www.wikidata.org/entity/">http://www.wikidata.org/entity/</a>",&#x2026;
which means that our location field was not formed correctly!  After
fixing it to look like <a href="http://www.wikidata.org/entity/Q65">http://www.wikidata.org/entity/Q65</a> (note http
instead on https and entity instead of wiki) the submission went
through. Reload the page (it won't empty the fields) to re-enable the
submit button.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><small>Created by <a href="http://thebird.nl/">Pjotr Prins</a> (pjotr.public768 at thebird 'dot' nl) using Emacs org-mode and a healthy dose of Lisp!<br />Modified 2020-05-30 Sat 10:44</small>.
</div>
</body>
</html>
